/*Предмет - парламентські вибори .

Початкові дані зчитуються з файла.
Після закінчення роботи з базою, обновлені дані записуються назад в файл.
Від однієї партії висувається один кандидат по одному округу.
Вьсого округів 5.
Тобто від однієї партії в списку буде 5 кандидатів, але всі від різних округів.

Картотека складається з полів :
-порядковий номер у бюлетені;
-назва партії, від якої балотується кандидат в депутати (Поянення:кандидат може бути і позафракційним);
-прізвище, ім"я та по-батькові кандидата;
- номер округу, в якому балотується кандидат; (в умові задачі буде поставлено завдання "відсортувати за округом);
- індекс популярності.(Пояснення : число від 0 до 10.на його основі планую зробити формулу, 
  за якою буде виставлятись кільксть голосів.
        Ще не придумала її, але ьам має бути задіяний цей індекс популярності та рандомна змінна.Щоб кожен раз
        при зчитуванні з файлу, заповнило нові дані про кількість голосів).
- кількість голосів виборців, які було віддано за цього кандидата.

    Реалізувати:
-зчитати дані з файла.
- доповнення бази даних(додати нового);
- перегляд даних про всіх кандидатів.
- видалення із бази даних.
- редагування даних про кандидата.
- порядкування по полях. (там ще вирішимо по яких.Наприклад, в кого найменший індекс популярності)
- пошук: усі зведення про кандидата Петрова(наприклад).
- вибірка : -кандидати від певної партії, які подали документи в ЦВК останного дня(придумати дату).
- позафракційні кандидати.
- Які кандидати набрали мінімальну чи максимальну кількість голосів виборців в певних округах, які задає користувач.
- корекція : видалення кандидата, який зняв свою кандидатуру(Пояснення; паралельно в цьому методі класу треба реалізувати можливість
    внесення нового кандидата на місце видаленого.Думаю має бути діалогове вікно.Щось на зразок : вискакує запитання чи хочемо на місце видаленого внести нового чи ні).
    - табличний звіт : список кандидатів, згрупованих по партіям, округам;
-список партій - переможниць виборів з деталізацією по кандидаьам, округам і кількістю голосів.

*/


/*
На даний момент готово:
- Зчитування з файла і запис в файл
- Виведення всіх кандидатів у вигляді таблиці
- Пошук по прізвищу
- Пошук по партії
- Пошук по округу
- Додати нового кандидата
- Редагувати інформацію про кандидата
-
-
-
-


*/