/*Предмет - парламентські вибори .

Початкові дані зчитуються з файла.
Після закінчення роботи з базою, обновлені дані записуються назад в файл.
Від однієї партії висувається один кандидат по одному округу.
Вьсого округів 5, партій 8.
Тобто від однієї партії в списку буде 5 кандидатів, але всі від різних округів.

Картотека складається з полів :
-порядковий номер у бюлетені;
-назва партії, від якої балотується кандидат в депутати;
-прізвище, ім"я та по-батькові кандидата;
- номер округу, в якому балотується кандидат; (в умові задачі буде поставлено завдання "відсортувати за округом);
- рейтинг;
- кількість голосів виборців, які було віддано за цього кандидата.

    Реалізувати:
-зчитати дані з файла.
- доповнення бази даних(додати нового);
- перегляд даних про всіх кандидатів.
- видалення із бази даних.
- редагування даних про кандидата.
- порядкування по полях. 
- пошук: усі зведення про кандидата Петрова(наприклад).
- Які кандидати набрали мінімальну чи максимальну кількість голосів виборців в певних округах, які задає користувач.
- корекція : видалення кандидата, який зняв свою кандидатуру
- табличний звіт : список кандидатів, згрупованих по партіям, округам;
- список партій - переможниць виборів з деталізацією по кандидаьам, округам і кількістю голосів.
*/


/*
На даний момент готово:
- Зчитування з файла і запис в файл
- Виведення всіх кандидатів у вигляді таблиці
- Пошук по прізвищу
- Пошук по партії
- Пошук по округу
- Додати нового кандидата
- Редагувати інформацію про кандидата
-
-
-
-


*/
